In [1]:
from aframe import AFrame
import pandas as pd
from aframe.connector import SQLConnector
from aframe.connector import AsterixConnector
from aframe.connector import CypherConnector

# Input and Output

## Pandas

### 1. read_csv

In [2]:
csv_file_path = './employees.csv'

In [3]:
pd_df = pd.read_csv(csv_file_path, sep=',', dtype={'id':'int64', 'ename':'string', 'job':'string', 'mgr_id':'int', 
                                                   'hiredate':'string', 'sal':'int', 'comm':'int', 'deptno':'int'})

In [4]:
pd_df.head()

   id  ename       job  mgr_id     hiredate   sal  comm  deptno
0   6  BLAKE   MANAGER       9   1-May-2018  2850     0      30
1  11  ADAMS     CLERK       8  23-May-2018  1100     0      20
2   1  SMITH     CLERK       8  17-Dec-2018   800    20      10
3   2  ALLEN  SALESMAN       6  20-Feb-2019  1600   300      30
4   8  SCOTT   ANALYST       4  19-Apr-2018  3000     0      20

In [5]:
pd_df.dtypes

id           int64
ename       string
job         string
mgr_id       int64
hiredate    string
sal          int64
comm         int64
deptno       int64
dtype: object

### 2. read_json

In [6]:
json_file_path = './employee.json'

In [7]:
pd_df = pd.read_json(json_file_path, orient='record', lines=True)

In [8]:
pd_df.head()

   id   ename       job  mgr_id     hiredate   sal  comm  deptno
0   1   SMITH     CLERK     8.0  17-Dec-2010   800    20      10
1   2   ALLEN  SALESMAN     6.0  20-Feb-2011  1600   300      30
2   3    WARD  SALESMAN     6.0  22-Feb-2011  1250   500      30
3   4   JONES   MANAGER     9.0   2-Apr-2011  2975     0      20
4   5  MARTIN  SALESMAN     6.0  28-Sep-2011  1250  1400      30

## PolyFrame + Neo4j

### 1. read_csv

In [9]:
cypher_connector = CypherConnector(username='neo4j', password='password')

In [10]:
neo_df = AFrame.read_csv(cypher_connector, csv_file_path, sep=',')

In [11]:
neo_df.head()

  mgr_id comm  ename  id       job     hiredate deptno   sal
0      9    0  BLAKE   6   MANAGER   1-May-2018     30  2850
1      8    0  ADAMS  11     CLERK  23-May-2018     20  1100
2      8   20  SMITH   1     CLERK  17-Dec-2018     10   800
3      6  300  ALLEN   2  SALESMAN  20-Feb-2019     30  1600
4      4    0  SCOTT   8   ANALYST  19-Apr-2018     20  3000

In [12]:
print(neo_df.query)

LOAD CSV WITH HEADERS FROM "file:///Users/gift/github/Data/employees.csv" AS rows FIELDTERMINATOR ','
WITH rows as t

In [13]:
print(neo_df.head(query=True))

LOAD CSV WITH HEADERS FROM "file:///Users/gift/github/Data/employees.csv" AS rows FIELDTERMINATOR ','
WITH rows as t
RETURN t
LIMIT 5

In [14]:
sal_df = neo_df[neo_df['deptno'] == '30'][['ename', 'sal', 'deptno']]

In [15]:
sal_df.head()

    ename deptno   sal
0   BLAKE     30  2850
1   ALLEN     30  1600
2  TURNER     30  1500
3  MARTIN     30  1250
4    WARD     30  1250

In [16]:
print(sal_df.head(query=True))

LOAD CSV WITH HEADERS FROM "file:///Users/gift/github/Data/employees.csv" AS rows FIELDTERMINATOR ','
WITH rows as t
WITH t WHERE t.deptno = "30"
WITH t{`ename`:t.ename, `sal`:t.sal, `deptno`:t.deptno}
RETURN t
LIMIT 5

### 2. read_json

In [17]:
neo_df = AFrame.read_json(cypher_connector, filepath=json_file_path)

In [18]:
neo_df.head(15)

     ename  mgr_id  comm  id        job     hiredate  deptno   sal
0    SMITH     8.0    20   1      CLERK  17-Dec-2010      10   800
1    ALLEN     6.0   300   2   SALESMAN  20-Feb-2011      30  1600
2     WARD     6.0   500   3   SALESMAN  22-Feb-2011      30  1250
3    JONES     9.0     0   4    MANAGER   2-Apr-2011      20  2975
4   MARTIN     6.0  1400   5   SALESMAN  28-Sep-2011      30  1250
5    BLAKE     9.0     0   6    MANAGER   1-May-2011      30  2850
6    CLARK     9.0     0   7    MANAGER   9-Jun-2011      10  2450
7    SCOTT     4.0     0   8    ANALYST  19-Apr-2017      20  3000
8     KING     NaN     0   9  PRESIDENT  17-Nov-2011      10  5000
9   TURNER     6.0     0  10   SALESMAN   8-Sep-2011      30  1500
10   ADAMS     8.0     0  11      CLERK  23-May-2017      20  1100

In [19]:
print(neo_df.head(query=True))

CALL apoc.load.json("file:///Users/gift/github/Data/employee.json") YIELD value
WITH value as t
RETURN t
LIMIT 5

In [20]:
sal_df = neo_df[neo_df['deptno'] == 30][['ename', 'sal', 'deptno', 'job']]

In [21]:
sal_df.head()

    ename       job  deptno   sal
0   ALLEN  SALESMAN      30  1600
1    WARD  SALESMAN      30  1250
2  MARTIN  SALESMAN      30  1250
3   BLAKE   MANAGER      30  2850
4  TURNER  SALESMAN      30  1500

In [22]:
print(sal_df.head(query=True))

CALL apoc.load.json("file:///Users/gift/github/Data/employee.json") YIELD value
WITH value as t
WITH t WHERE t.deptno = 30
WITH t{`ename`:t.ename, `sal`:t.sal, `deptno`:t.deptno, `job`:t.job}
RETURN t
LIMIT 5

### Saving results => create nodes

In [23]:
sales = sal_df.to_collection('sales_dept')

In [24]:
sales.head()

    ename       job  deptno   sal
0   ALLEN  SALESMAN      30  1600
1    WARD  SALESMAN      30  1250
2  MARTIN  SALESMAN      30  1250
3   BLAKE   MANAGER      30  2850
4  TURNER  SALESMAN      30  1500

In [25]:
print(sales.query)

MATCH(t: sales_dept)

In [26]:
print(sal_df.to_collection('managers', query=True))

CALL apoc.load.json("file:///Users/gift/github/Data/employee.json") YIELD value
WITH value as t
WITH t WHERE t.deptno = 30
WITH t{`ename`:t.ename, `sal`:t.sal, `deptno`:t.deptno, `job`:t.job}
CREATE (n:managers)
SET n = t

In [27]:
sales.drop_collection()

## AsterixDB + PolyFrame

## read_json

In [31]:
connector = AsterixConnector(server_address='localhost:19002')

In [32]:
asterix_df = AFrame.read_json(connector, 
                json_file_path, 
                name='new_employees', 
                namespace='company')

In [33]:
asterix_df.head()

   id   ename       job  mgr_id     hiredate   sal  comm  deptno
0   1   SMITH     CLERK     8.0  17-Dec-2010   800    20      10
1   2   ALLEN  SALESMAN     6.0  20-Feb-2011  1600   300      30
2   3    WARD  SALESMAN     6.0  22-Feb-2011  1250   500      30
3   4   JONES   MANAGER     9.0   2-Apr-2011  2975     0      20
4   5  MARTIN  SALESMAN     6.0  28-Sep-2011  1250  1400      30

In [34]:
print(AFrame.read_json(connector, json_file_path, name='new_employees', namespace='company', query=True))

CREATE TYPE company._internalAnyType IF NOT EXISTS AS {};
CREATE EXTERNAL DATASET company.new_employees(_internalAnyType)
USING localfs
(("path"="localhost:///Users/gift/github/Data/employee.json"), ("format"="adm"))
WITH {"storage-block-compression": {"scheme": "snappy"}};

In [35]:
print(asterix_df.head(query=True))

SELECT VALUE t FROM company.new_employees t LIMIT 5

In [36]:
asterix_df.drop_collection()

'success'

## Output

## PolyFrame + PostgreSQL

### 1. View

In [27]:
postgres_connector = SQLConnector("postgres://user:pass@localhost:5432/company")

In [28]:
af = AFrame(dataverse='company', dataset='employees', connector=postgres_connector)

In [29]:
af.head()

   id  ename       job  mgr_id    hiredate   sal  comm  deptno
0   6  BLAKE   MANAGER       9  2018-05-01  2850     0      30
1  11  ADAMS     CLERK       8  2018-05-23  1100     0      20
2   1  SMITH     CLERK       8  2018-12-17   800    20      10
3   2  ALLEN  SALESMAN       6  2019-02-20  1600   300      30
4   8  SCOTT   ANALYST       4  2018-04-19  3000     0      20

In [30]:
len(af)

11

In [31]:
af = af[['id', 'ename', 'comm', 'deptno', 'sal']]

In [32]:
depts = AFrame.get_dummies(af['deptno'], prefix=True)
depts.head()

   deptno  deptno_10  deptno_30  deptno_20
0      30          0          1          0
1      20          0          0          1
2      10          1          0          0
3      30          0          1          0
4      20          0          0          1

In [33]:
comms = AFrame.get_dummies(af['comm'], prefix=True)
comms.head()

   comm  comm_300  comm_0  comm_500  comm_1400  comm_20
0     0         0       1         0          0        0
1     0         0       1         0          0        0
2    20         0       0         0          0        1
3   300         1       0         0          0        0
4     0         0       1         0          0        0

In [34]:
transformed = AFrame.concat([af, depts, comms], axis=1)

In [35]:
transformed.head()

,id,ename,comm,deptno,sal,deptno_10,deptno_30,deptno_20,comm_300,comm_0,comm_500,comm_1400,comm_20
0,6,BLAKE,0,30,2850,0,1,0,0,1,0,0,0
1,11,ADAMS,0,20,1100,0,0,1,0,1,0,0,0
2,1,SMITH,20,10,800,1,0,0,0,0,0,0,1
3,2,ALLEN,300,30,1600,0,1,0,1,0,0,0,0
4,8,SCOTT,0,20,3000,0,0,1,0,1,0,0,0

In [36]:
print(transformed.query)

SELECT t.*, ((deptno = 10) :: INTEGER) AS "deptno_10", ((deptno = 30) :: INTEGER) AS "deptno_30", ((deptno = 20) :: INTEGER) AS "deptno_20", ((comm = 300) :: INTEGER) AS "comm_300", ((comm = 0) :: INTEGER) AS "comm_0", ((comm = 500) :: INTEGER) AS "comm_500", ((comm = 1400) :: INTEGER) AS "comm_1400", ((comm = 20) :: INTEGER) AS "comm_20" FROM (SELECT id, ename, comm, deptno, sal FROM (SELECT * FROM employees) t) t

In [37]:
transformed.to_view(name='employees_view', query=True)

'CREATE OR REPLACE VIEW employees_view AS SELECT t.*, ((deptno = 10) :: INTEGER) AS "deptno_10", ((deptno = 30) :: INTEGER) AS "deptno_30", ((deptno = 20) :: INTEGER) AS "deptno_20", ((comm = 300) :: INTEGER) AS "comm_300", ((comm = 0) :: INTEGER) AS "comm_0", ((comm = 500) :: INTEGER) AS "comm_500", ((comm = 1400) :: INTEGER) AS "comm_1400", ((comm = 20) :: INTEGER) AS "comm_20" FROM (SELECT id, ename, comm, deptno, sal FROM (SELECT * FROM employees) t) t;'

In [38]:
employees_view = transformed.to_view(name='employees_view')

In [39]:
employees_view.head(2)

,id,ename,comm,deptno,sal,deptno_10,deptno_30,deptno_20,comm_300,comm_0,comm_500,comm_1400,comm_20
0,6,BLAKE,0,30,2850,0,1,0,0,1,0,0,0
1,11,ADAMS,0,20,1100,0,0,1,0,1,0,0,0

In [40]:
employees_view.query

'SELECT * FROM employees_view'

In [41]:
employees_view.drop_view()

True

### 2. collection

In [47]:
transformed.to_collection(name='employees_features', query=True)

'CREATE TABLE employees_features AS SELECT * FROM (SELECT t.*, ((deptno = 10) :: INTEGER) AS "deptno_10", ((deptno = 30) :: INTEGER) AS "deptno_30", ((deptno = 20) :: INTEGER) AS "deptno_20", ((comm = 300) :: INTEGER) AS "comm_300", ((comm = 0) :: INTEGER) AS "comm_0", ((comm = 500) :: INTEGER) AS "comm_500", ((comm = 1400) :: INTEGER) AS "comm_1400", ((comm = 20) :: INTEGER) AS "comm_20" FROM (SELECT id, ename, comm, deptno, sal FROM (SELECT * FROM employees) t) t) t;'

In [48]:
new_emp = transformed.to_collection(name='employees_features')

In [49]:
new_emp.head()

,id,ename,comm,deptno,sal,deptno_10,deptno_30,deptno_20,comm_300,comm_0,comm_500,comm_1400,comm_20
0,6,BLAKE,0,30,2850,0,1,0,0,1,0,0,0
1,11,ADAMS,0,20,1100,0,0,1,0,1,0,0,0
2,1,SMITH,20,10,800,1,0,0,0,0,0,0,1
3,2,ALLEN,300,30,1600,0,1,0,1,0,0,0,0
4,8,SCOTT,0,20,3000,0,0,1,0,1,0,0,0

In [50]:
print(new_emp.query)

SELECT * FROM employees_features

In [51]:
new_emp.drop_collection()

True

### 3. Transformation Attempt

In [52]:
af = AFrame(dataverse='company', dataset='employees', connector=postgres_connector)

In [53]:
af.head(2)

   id  ename      job  mgr_id    hiredate   sal  comm  deptno
0   6  BLAKE  MANAGER       9  2018-05-01  2850     0      30
1  11  ADAMS    CLERK       8  2018-05-23  1100     0      20

In [54]:
enames = af['ename']
enames.head()

   ename
0  BLAKE
1  ADAMS
2  SMITH
3  ALLEN
4  SCOTT

In [55]:
print(enames.query)

SELECT ename FROM (SELECT * FROM employees) t

In [56]:
print(enames.to_transformation(name='get_ename', query=True))

CREATE FUNCTION get_ename(employees) RETURNS RECORD
AS $$ SELECT * FROM (SELECT ename FROM (SELECT $1.*) t) t $$
LANGUAGE SQL;

In [58]:
enames.to_transformation(name='get_ename')

In [59]:
af.head(2)

   id  ename      job  mgr_id    hiredate   sal  comm  deptno
0   6  BLAKE  MANAGER       9  2018-05-01  2850     0      30
1  11  ADAMS    CLERK       8  2018-05-23  1100     0      20

In [60]:
af.apply('get_ename').head()

  get_ename
0   (BLAKE)
1   (ADAMS)
2   (SMITH)
3   (ALLEN)
4   (SCOTT)

In [61]:
enames.drop_transformation(name='get_ename')

True